{
    "ko": {
        "title": "개인정보처리방침",
        "content": "<h3>개인정보처리방침</h3><ol><li><strong>수집하는 정보</strong><br>우리 앱은 사용자의 카메라를 통해 이미지를 캡처하고 처리하기 위해 카메라 권한을 요청합니다. 사용자가 이 권한을 허용할 경우, 앱은 다음과 같은 정보를 수집할 수 있습니다:<ul><li><strong>캡처된 이미지</strong>: 앱 기능 수행을 위해 캡처된 이미지를 사용하며, 해당 이미지는 앱 내에서만 사용됩니다.</li><li><strong>이미지에서 추출된 텍스트</strong>: 텍스트는 Firebase의 클라우드 서버에 저장되며, 앱의 서비스 제공 목적으로만 사용됩니다.</li></ul></li><li><strong>정보 사용 목적</strong><br>수집한 정보는 다음과 같은 목적으로 사용됩니다:<ul><li><strong>이미지 분석 및 처리</strong>: 사용자에게 제공되는 기능을 수행하기 위해 카메라로 촬영한 이미지를 앱 내에서 처리합니다.</li><li><strong>텍스트 데이터 활용</strong>: 이미지에서 추출된 텍스트는 앱의 서비스를 개선하고 사용자에게 맞춤형 경험을 제공하기 위해 사용됩니다.</li><li><strong>사용자 경험 개선</strong>: 사용자 피드백과 사용 패턴을 기반으로 앱의 기능을 개선하기 위해 내부적으로 분석할 수 있습니다.</li></ul></li><li><strong>정보 보호</strong><br>우리 앱은 사용자의 개인정보를 안전하게 보호하기 위해 다음과 같은 조치를 취하고 있습니다:<ul><li>사용자의 이미지는 외부 서버로 전송되지 않으며, 앱 내에서만 처리됩니다.</li><li>이미지에서 추출된 텍스트는 Firebase의 안전한 클라우드 서버에 저장되며, 오직 서비스 제공 목적을 위해서만 접근됩니다.</li></ul></li><li><strong>정보 공유</strong><br>우리 앱은 사용자의 이미지를 제3자와 공유하지 않습니다. 또한, 법적 요구가 없는 한 어떠한 개인 정보도 외부에 제공하지 않습니다. 이미지에서 추출된 텍스트는 앱의 서비스 제공 외 목적으로는 사용되지 않습니다.</li><li><strong>정보 보유 기간</strong><br>이미지에서 추출된 텍스트는 서비스 제공을 위해 필요한 기간 동안만 보관됩니다.</li><li><strong>사용자 권리</strong><br>사용자는 언제든지 카메라 권한을 거부할 수 있으며, 이 경우 일부 기능 사용에 제한이 있을 수 있습니다. 또한, 앱의 개인정보 처리방침에 대한 문의가 있을 경우 아래 연락처로 문의할 수 있습니다.</li><li><strong>연락처 정보</strong><br>앱 관련 문의사항이 있을 경우 다음 연락처로 문의해 주세요:<br>이메일: netmelondev@gmail.com</li></ol>"
    },
    "en": {
        "title": "Privacy Policy",
        "content": "<h3>Privacy Policy</h3><ol><li><strong>Information Collected</strong><br>Our app requests camera permission to capture and process images. If granted, the app may collect:<ul><li><strong>Captured Images</strong>: Used solely within the app to perform app functions.</li><li><strong>Extracted Text from Images</strong>: Stored on Firebase cloud servers and used exclusively for service provision.</li></ul></li><li><strong>Purpose of Information Usage</strong><br>The collected information is used for:<ul><li><strong>Image Analysis and Processing</strong>: To perform app functions, images taken by the camera are processed within the app.</li><li><strong>Use of Text Data</strong>: Extracted text is used to improve app services and provide a tailored user experience.</li><li><strong>Improving User Experience</strong>: Internal analysis is done to enhance app functionality based on feedback and usage patterns.</li></ul></li><li><strong>Information Protection</strong><br>Our app takes the following steps to protect user data:<ul><li>Captured images are not transmitted externally and are processed solely within the app.</li><li>Extracted text is stored securely on Firebase cloud servers and accessed only for service purposes.</li></ul></li><li><strong>Information Sharing</strong><br>The app does not share users' images with third parties. No personal information is disclosed externally unless legally required, and extracted text is used only for service provision.</li><li><strong>Data Retention Period</strong><br>Extracted text is retained only for the necessary period to provide the service.</li><li><strong>User Rights</strong><br>Users may revoke camera permission at any time, though some features may become restricted. For inquiries regarding the app's privacy policy, please contact us.</li><li><strong>Contact Information</strong><br>For inquiries related to the app, please contact us at:<br>Email: netmelondev@gmail.com</li></ol>"
    }
}
