{
  "ko": {
    "title": "이용약관",
    "content": "<h3>이용약관</h3><ol><li><strong>적용 범위 및 동의</strong><br>본 이용약관은 Netmelon(이하 '서비스 제공자')에서 무료로 제공하는 모바일 애플리케이션 내팝퀴즈(이하 '애플리케이션')에 적용됩니다. 애플리케이션을 다운로드하거나 사용함으로써 귀하는 본 약관에 동의하게 됩니다.</li><li><strong>지적재산권 및 사용 제한</strong><br>애플리케이션 및 관련 서비스의 무단 복사, 수정, 소스코드 추출, 타 언어로의 번역, 파생 버전 제작은 엄격히 금지되며, 모든 상표권 및 저작권, 데이터베이스 권리, 기타 지적재산권은 서비스 제공자에 귀속됩니다.</li><li><strong>회사소개</strong><br>Netmelon은 고객의 요구에 맞춘 혁신적인 인공지능 기술이 결합된 모바일 애플리케이션 개발 기업입니다. 자세한 정보는 <a href='https://netmelonai.com/#about'>https://netmelonai.com/#about</a>에서 확인하실 수 있습니다.</li><li><strong>로그인</strong><br>애플리케이션을 사용하기 위해서는 구글 또는 애플 계정 로그인이 필요합니다.</li><li><strong>PDF 생성 및 책임</strong><br>애플리케이션에서 생성된 PDF는 법적 효력이 없으며, 모든 책임은 사용자에게 있습니다. 생성된 PDF의 내용 및 사용에 따른 결과에 대해 서비스 제공자는 책임을 지지 않습니다.</li><li><strong>서비스의 변경 및 요금</strong><br>서비스 제공자는 언제든지 애플리케이션이나 그 일부를 수정하거나, 요금을 부과할 권리를 보유합니다. 요금이 부과될 경우 이를 사전에 고지합니다.</li><li><strong>개인정보 및 기기 보안</strong><br>애플리케이션은 서비스 제공을 위해 제공된 개인 데이터를 저장 및 처리합니다. 기기 보안 유지 및 접근 권한 관리 책임은 사용자에게 있습니다. 탈옥(jailbreaking) 또는 루팅(rooting) 등 비정상적 행위는 권장하지 않으며, 이로 인한 보안 위협 및 작동 오류에 대해 책임지지 않습니다.</li><li><strong>제3자 서비스</strong><br>애플리케이션은 다음의 제3자 서비스를 사용할 수 있으며, 각 서비스 제공자의 약관이 적용됩니다:<ul><li>Google Play Services</li><li>Apple Inc.</li><li>AdMob</li><li>Google Analytics for Firebase</li><li>Firebase Crashlytics</li></ul></li><li><strong>인터넷 연결</strong><br>일부 기능은 활성화된 인터넷 연결이 필요하며, Wi-Fi 또는 모바일 네트워크 환경에 따라 애플리케이션의 정상 동작이 보장되지 않을 수 있습니다. 데이터 요금 발생 여부 및 모든 비용은 사용자에게 책임이 있습니다.</li><li><strong>기기 및 서비스 이용 책임</strong><br>기기의 충전 상태 유지 등은 사용자 책임이며, 배터리 방전 등으로 인한 서비스 이용 불가에 대해 책임지지 않습니다.</li><li><strong>정보의 정확성 및 최신성</strong><br>서비스 제공자는 최신 정보 제공을 위해 노력하나, 제3자 정보에 기반한 일부 기능의 정확성에 대해 직접적, 간접적 책임을 지지 않습니다.</li><li><strong>애플리케이션 업데이트 및 종료</strong><br>애플리케이션은 언제든지 업데이트되거나 제공이 중단될 수 있으며, 서비스 종료 시 사용자는 애플리케이션을 삭제해야 할 수 있습니다.</li><li><strong>약관의 변경</strong><br>서비스 제공자는 본 약관을 수시로 업데이트할 수 있으며, 변경 시 본 페이지를 통해 고지합니다.</li><li><strong>문의하기</strong><br>이용약관 관련 문의는 <a href=\"mailto:netmelon@netmelonai.com\">netmelon@netmelonai.com</a>으로 연락해 주십시오.</li><li><strong>시행일</strong><br>본 약관은 2024년 10월 25일부터 시행됩니다.</li></ol>"
  },
  "en": {
    "title": "Terms of Service",
    "content": "<h3>Terms of Service</h3><ol><li><strong>Scope and Agreement</strong><br>These Terms of Service apply to the Naepopquiz mobile application (hereinafter referred to as 'the Application') provided for free by Netmelon (hereinafter referred to as 'the Service Provider'). By downloading or using the Application, you agree to these terms.</li><li><strong>Intellectual Property and Use Restrictions</strong><br>Unauthorized copying, modification, extraction of source code, translation, or creation of derivative versions of the Application and its services is strictly prohibited. All trademarks, copyrights, database rights, and other intellectual property rights related to the Application belong to the Service Provider.</li><li><strong>Company Information</strong><br>Netmelon develops mobile applications using innovative AI technology tailored to customer needs. For more information, visit <a href='https://netmelonai.com/#about'>https://netmelonai.com/#about</a>.</li><li><strong>Login</strong><br>Google or Apple login is required to use the Application.</li><li><strong>PDF Generation and Liability</strong><br>PDFs generated by the Application have no legal effect, and all responsibility lies with the user. The Service Provider is not liable for the content or any consequences resulting from the use of generated PDFs.</li><li><strong>Service Modification and Fees</strong><br>The Service Provider reserves the right to modify or charge for the Application or its services at any time. Any charges will be clearly communicated in advance.</li><li><strong>Personal Data and Device Security</strong><br>The Application stores and processes personal data provided for service delivery. Users are responsible for maintaining device security and managing access permissions. Jailbreaking or rooting is not recommended, and the Service Provider is not responsible for any security risks or malfunctions resulting from such actions.</li><li><strong>Third-Party Services</strong><br>The Application may use the following third-party services, subject to each provider's terms:<ul><li>Google Play Services</li><li>Apple Inc.</li><li>AdMob</li><li>Google Analytics for Firebase</li><li>Firebase Crashlytics</li></ul></li><li><strong>Internet Connection</strong><br>Some features require an active internet connection. The Application may not function properly depending on Wi-Fi or mobile network conditions. Users are responsible for all data charges and costs.</li><li><strong>Device and Service Use Responsibility</strong><br>Users are responsible for keeping their devices charged. The Service Provider is not liable for service unavailability due to device battery depletion.</li><li><strong>Accuracy and Timeliness of Information</strong><br>The Service Provider strives to provide up-to-date information, but is not directly or indirectly responsible for the accuracy of certain features based on third-party information.</li><li><strong>Application Updates and Discontinuation</strong><br>The Application may be updated or discontinued at any time. Upon service discontinuation, users may be required to delete the Application.</li><li><strong>Changes to Terms</strong><br>The Service Provider may update these Terms of Service from time to time. Changes will be notified on this page.</li><li><strong>Contact</strong><br>For inquiries regarding the Terms of Service, please contact <a href=\"mailto:netmelon@netmelonai.com\">netmelon@netmelonai.com</a>.</li><li><strong>Effective Date</strong><br>These Terms are effective from October 25, 2024.</li></ol>"
  }
}
